<?php
//以后再弄数据库的

// $_POST['dir'] = 'file_swift_0919';
$dir = $_POST['dir'] . '/';

$studentId = ["05180842","06181248","07180901", "07180902", "07180903", "07180904", "07180905", "07180906", "07180907", "07180908", "07180909", "07180910", "07180911", "07180912", "07180913", "07180914", "07180915", "07180916", "07180917", "07180918", "07180919", "07180920", "07180921", "07180922", "07180923", "07180924", "07180925", "07180926", "07180927", "07180928", "07180929", "07180930", "07180931", "07180932", "07180933", "07180934", "07180935", "07180936", "07180937", "07180938", "07180939", "07180940", "07180941", "07180942", "07180943", "07180944", "07180945", "07180946", "07180947", "07180948", "07180949", "07180950", "07180951", "07180952", "07180953", "07180954"];
if (!file_exists($dir)) {
    echo json_encode(['暂无上交']);
    exit();
}
query($dir);
function query($dir){
    global $studentId;
    $fileList = scandir($dir);
    $i = 0;
    foreach ($fileList as $key => $fileItem) {
        preg_match("/\d{8}/", $fileItem, $match);
        // var_dump($match);
        if (!empty($match)) {
            $list[$i] = $match[0];
            $i++;
        }
    }
    $notUpload = [];
    foreach($studentId as $id){
        if(!in_array($id,$list)){
            array_push($notUpload,$id);
        }
    }
    array_push($notUpload,count($notUpload));
    echo json_encode($notUpload);
}